In [1]:
import pandas as pd

In [40]:
chicago = pd.read_csv('chicago.csv')
chicago

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00
...,...,...,...,...
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00
32062,NaN,NaN,NaN,NaN

In [41]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  object
dtypes: object(4)
memory usage: 1002.1+ KB

In [42]:
chicago.Department = chicago.Department.astype('category')

In [43]:
chicago['Position Title'] = chicago['Position Title'].astype('category')

In [48]:
chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].replace('\$','', regex=True)

In [37]:
chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].replace('.','', regex=True)

In [55]:
chicago = chicago.dropna()

In [59]:
chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].astype('float')

C:\Users\User\AppData\Local\Temp\ipykernel_12836\2664688801.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].astype('float')

In [60]:
chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].astype('int')

C:\Users\User\AppData\Local\Temp\ipykernel_12836\4248870467.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].astype('int')

In [61]:
chicago['Employee Annual Salary']

0         90744
1         84450
2         84450
3         89880
4        106836
          ...
32057     99528
32058     87384
32059     84450
32060     87384
32061    113664
Name: Employee Annual Salary, Length: 32062, dtype: int32

In [65]:
chicago['Name'].str.split(',').str.get(0).value_counts()

WILLIAMS     293
JOHNSON      244
SMITH        241
BROWN        185
JONES        183
            ...
HORN           1
HORNE JR       1
HORNER         1
HORNIK         1
ZYSKOWSKI      1
Name: Name, Length: 13830, dtype: int64

In [75]:
chicago['Name'].str.split(',').str.get(1).str.strip().str.split(' ').str.get(0).value_counts()

MICHAEL     1153
JOHN         899
JAMES        676
ROBERT       622
JOSEPH       537
            ...
DEENA          1
CHERRISE       1
EARTHA         1
ERNIKA         1
MAC            1
Name: Name, Length: 5091, dtype: int64

In [80]:
chicago[['First Name','Last Name']] = chicago['Name'].str.split(',', expand =True)

C:\Users\User\AppData\Local\Temp\ipykernel_12836\3629102190.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  chicago[['First Name','Last Name']] = chicago['Name'].str.split(',', expand =True)
C:\Users\User\AppData\Local\Temp\ipykernel_12836\3629102190.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  chicago[['First Name','Last Name']] = chicago['Name'].str.split(',', expand =True)

In [83]:
chicago= chicago.drop(columns='Name')

In [87]:
chicago = chicago.reindex(columns=['First Name','Last Name','Position Title', 'Department','Employee Annual Salary'])

In [91]:
chicago.set_index('First Name')

,Last Name,Position Title,Department,Employee Annual Salary
First Name,,,,
AARON,ELVIA J,WATER RATE TAKER,WATER MGMNT,90744
AARON,JEFFERY M,POLICE OFFICER,POLICE,84450
AARON,KARINA,POLICE OFFICER,POLICE,84450
AARON,KIMBERLEI R,CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,89880
ABAD JR,VICENTE M,CIVIL ENGINEER IV,WATER MGMNT,106836
...,...,...,...,...
ZYGADLO,MICHAEL J,FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,99528
ZYGOWICZ,PETER J,POLICE OFFICER,POLICE,87384
ZYMANTAS,MARK E,POLICE OFFICER,POLICE,84450
ZYRKOWSKI,CARLO E,POLICE OFFICER,POLICE,87384
ZYSKOWSKI,DARIUSZ,CHIEF DATA BASE ANALYST,DoIT,113664